{
  "data": {
    "comics": [
      {
        "publisher": "BOOM! STUDIOS",
        "description": "* Bear is a guide dog for the blind, and he would do anything for his best friend and owner, Patrick. But when Bear suddenly loses his own vision, he worries that he has lost his purpose! Determined to protect Patrick at all costs, Bear sets out on a quest to regain his eyesight.  * Along the way Bear will learn to tap into his other senses and begin to see the world from a new perspective that is at times more rich and colorful than the world he's always known. * Writer Ben Queen (Disney/Pixar's Cars 2 and Cars 3) draws inspiration from real life stories of how memory can influence how we recall our own surroundings, and artist Joe Todd-Stanton (A Mouse Called Julian) lovingly renders an unforgettable story of one dog's grand adventure from the wooded countryside to the heart of Manhattan where he encounters new friends and discovers his true calling. ",
        "title": "BEAR ORIGINAL GN HC",
        "price": "$24.99",
        "creators": "(W) Ben Queen (A/CA) Joe Todd-Stanton",
        "release_date": "2020-09-02",
        "diamond_id": "APR201332",
        "writer": "Ben Queen",
        "artist": "Joe Todd-Stanton",
        "cover_artist": "Joe Todd-Stanton"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "Fan favorite character Wesley Wyndam-Pryce makes his first appearance in this stand-alone issue that will change everything you know about the Watchers! After the devastating effects of Hellmouth, the Watcher's Council convenes to make sure it never happens again. But when recent Watcher initiate Wesley Wyndam-Pryce stumbles across a dark secret, he learns of a conspiracy decades in the making - one that binds Robin, Giles and the Slayer Before together, and shows just how far the Watchers will go to protect the earth.",
        "title": "BUFFY THE VAMPIRE SLAYER #17 CVR A MAIN",
        "price": "$3.99",
        "creators": "(W) Jordie Bellaire (A/CA) David Lopez",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200893",
        "cover": "This is a cover",
        "writer": "Jordie Bellaire",
        "artist": "David Lopez",
        "cover_artist": "David Lopez"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "Fan favorite character Wesley Wyndam-Pryce makes his first appearance in this stand-alone issue that will change everything you know about the Watchers! After the devastating effects of Hellmouth, the Watcher's Council convenes to make sure it never happens again. But when recent Watcher initiate Wesley Wyndam-Pryce stumbles across a dark secret, he learns of a conspiracy decades in the making - one that binds Robin, Giles and the Slayer Before together, and shows just how far the Watchers will go to protect the earth.",
        "title": "BUFFY THE VAMPIRE SLAYER #17 CVR B SAUVAGE VAR",
        "price": "$3.99",
        "creators": "(W) Jordie Bellaire (A) David Lopez (CA) Marguerite Sauvage",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200894",
        "writer": "Jordie Bellaire",
        "artist": "David Lopez",
        "cover_artist": "Marguerite Sauvage"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "Fan favorite character Wesley Wyndam-Pryce makes his first appearance in this stand-alone issue that will change everything you know about the Watchers! After the devastating effects of Hellmouth, the Watcher's Council convenes to make sure it never happens again. But when recent Watcher initiate Wesley Wyndam-Pryce stumbles across a dark secret, he learns of a conspiracy decades in the making - one that binds Robin, Giles and the Slayer Before together, and shows just how far the Watchers will go to protect the earth.",
        "title": "BUFFY THE VAMPIRE SLAYER #17 CVR C CAREY FIRE VAR",
        "price": "$3.99",
        "creators": "(W) Jordie Bellaire (A) David Lopez (CA) Becca Carey",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200895",
        "writer": "Jordie Bellaire",
        "artist": "David Lopez",
        "cover_artist": "Becca Carey"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "After the shocking events of the last issue, Denis is forced to come to terms with the truth of his own past-and the enemies he made along the way. It all comes down to this, as citizens of Nowhere are forced to choose sides in a duel that could save, or destroy, the sanctity of their town. ",
        "title": "KING OF NOWHERE #5 (OF 5) CVR A MAIN",
        "price": "$3.99",
        "creators": "(W) Maxwell Prince (A/CA) Tyler Jenkins",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200922"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "After the shocking events of the last issue, Denis is forced to come to terms with the truth of his own past-and the enemies he made along the way. It all comes down to this, as citizens of Nowhere are forced to choose sides in a duel that could save, or destroy, the sanctity of their town. ",
        "title": "KING OF NOWHERE #5 (OF 5) CVR B MORAZZO VAR",
        "price": "$3.99",
        "creators": "(W) Maxwell Prince (A) Tyler Jenkins (CA) Martin Morazzo",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200923"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "A shocking traitor is revealed as the all-new OMEGA RANGERS-Jason, Zack and Trini-must turn to the MIGHTY MORPHIN POWER RANGERS to face the threat they never expected! But even as old friends and new allies join forces, can they put aside their mistrust to defeat an enemy with a mission to destroy EVERY Power Ranger in existence? New York Times bestselling author Ryan Parrott and artist Daniele Di Nicuolo deliver the next jaw-dropping chapter of the Power Rangers: Necessary Evil epic event that changes everything you thought you knew about the Power Rangers! Collects Mighty Morphin Power Rangers #44-47.",
        "title": "MIGHTY MORPHIN POWER RANGERS TP VOL 12",
        "price": "$16.99",
        "creators": "(W) Ryan Parrott (A) Daniele Nicuolo (CA) Jamal Campbell",
        "release_date": "2020-09-02",
        "diamond_id": "MAR201372"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "",
        "title": "SEVEN SECRETS #1 2ND PTG",
        "price": "$3.99",
        "creators": "(W) Tom Taylor (A) Daniele Di Nicuolo (CA) Dan Mora",
        "release_date": "2020-09-02",
        "diamond_id": "JUL208001"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "Join Steven, Connie, Lion, all the Crystal Gems and more for all-new adventures in Beach City and beyond from writer Sarah Gailey and artist Rii Abergo!? It's up to Steven and Connie to help cheer up the Crystal Gems, and help them learn how to fit into the strange human world they all live in. Collects Steven Universe  #29-32.",
        "title": "STEVEN UNIVERSE ONGOING TP VOL 08",
        "price": "$14.99",
        "creators": "(W) Sarah Gailey (A) Rii Abrego (CA) Missy Pena",
        "release_date": "2020-09-02",
        "diamond_id": "JUN200807"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "* For fans of Decorum and Something is Killing the Children comes a new sci-fi epic from Al Ewing (Immortal Hulk) and Simone Di Meo (Mighty Morphin Power Rangers) on the edge of space where humanity is harvesting the corpses of giant alien gods to survive.  * No one has ever seen a living god, but Captain Malik is obsessed with being the first. * Captain Malik and the crew of the Vihaan II harvest the only resources that matter from the giant corpses of alien gods found on the edge of human space. While other autopsy ships race to salvage the meat, minerals, and metals that sustain the human race, Malik sees an opportunity to finally break free from this system. * But Malik's obsession with the gods will push his crew into the darkest reaches of space, bringing them face to face with a threat unlike anything they've ever imagined - unless the rogue agent on their trail can stop them first... ",
        "title": "WE ONLY FIND THEM WHEN THEYRE DEAD #1 CVR A MAIN",
        "price": "$3.99",
        "creators": "(W) Al Ewing (A/CA) Simone Di Meo",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200871"
      },
      {
        "publisher": "BOOM! STUDIOS",
        "description": "* For fans of Decorum and Something is Killing the Children comes a new sci-fi epic from Al Ewing (Immortal Hulk) and Simone Di Meo (Mighty Morphin Power Rangers) on the edge of space where humanity is harvesting the corpses of giant alien gods to survive.  * No one has ever seen a living god, but Captain Malik is obsessed with being the first. * Captain Malik and the crew of the Vihaan II harvest the only resources that matter from the giant corpses of alien gods found on the edge of human space. While other autopsy ships race to salvage the meat, minerals, and metals that sustain the human race, Malik sees an opportunity to finally break free from this system. * But Malik's obsession with the gods will push his crew into the darkest reaches of space, bringing them face to face with a threat unlike anything they've ever imagined - unless the rogue agent on their trail can stop them first... ",
        "title": "WE ONLY FIND THEM WHEN THEYRE DEAD #1 CVR B INFANTE VAR",
        "price": "$3.99",
        "creators": "(W) Al Ewing (A) Simone Di Meo (CA) Toni Infante",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200872"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "The intercepted voice transmission has been interpreted-a dire warning . . . but is it too late? As the crew continues to survey the massive pyramid structure, they find an entrance. Who goes in, won't come out alone . . .  Adapted from the original 1976 screenplay by Dan O'Bannon (author of Moebius's The Long Tomorrow, cowriter of Total Recall, writer/director of The Return of the Living Dead).    ",
        "title": "ALIEN ORIGINAL SCREENPLAY #2 (OF 5) CVR A BALBI (RES)",
        "price": "$3.99",
        "creators": "(W) Cristiano Seixas (A/CA) Guilherme Balbi",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200268"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "The intercepted voice transmission has been interpreted-a dire warning . . . but is it too late? As the crew continues to survey the massive pyramid structure, they find an entrance. Who goes in, won't come out alone . . .  Adapted from the original 1976 screenplay by Dan O'Bannon (author of Moebius's The Long Tomorrow, cowriter of Total Recall, writer/director of The Return of the Living Dead).    ",
        "title": "ALIEN ORIGINAL SCREENPLAY #2 (OF 5) CVR B SIMONSON (RES)",
        "price": "$3.99",
        "creators": "(W) Cristiano Seixas (A) Guilherme Balbi (CA) Walter Simonson",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200269"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "Dr. Queen, scientist extraordinaire, is on the cutting edge of technology, industry, and-with the help of her telepathically controlled super car-terrorist butt kicking. But when things go south in her attempt to take down a hacking supervillain's diabolical plans, Queen finds that the lines between truth and fiction are blurred, and she's drafted into a war to save reality itself.  \"BANG! is a fun, twisty spy thriller with a great meta-twist.\"-Jay Faerber ",
        "title": "BANG #3 (OF 5) CVR A TORRES (RES)",
        "price": "$3.99",
        "creators": "(W) Matt Kindt (A/CA) Wilfredo Torres",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200270"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "Dr. Queen, scientist extraordinaire, is on the cutting edge of technology, industry, and-with the help of her telepathically controlled super car-terrorist butt kicking.  But when things go south in her attempt to take down a hacking supervillain's diabolical plans, Queen finds that the lines between truth and fiction are blurred, and she's drafted into a war to save reality itself.",
        "title": "BANG #3 (OF 5) CVR B KINDT (RES)",
        "price": "$3.99",
        "creators": "(W) Matt Kindt (A) Wilfredo Torres (CA) Matt Kindt",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200271"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "The newest addition to the Dark Horse line of graphic novels set in the world of gaming phenomenon Minecraft!  Cahira and Orion are twin monster hunters under the tutelage of Senan the Thorough. After an intense battle with an enchanted wither, their mentor is eaten, and the twins are now alone! The two hunters go on a mission to get their mentor back, and meet an unlikely ally along the way!  Stumbling into her underground home, Cahira and Orion meet Atria-a girl cursed as a monster lure! The twins convince Atria to join their rescue mission to use her monster-attracting abilities to find the enchanted wither . . . and Atria wants to learn how to protect herself against the mobs of monsters coming for her!  Jump into the Overworld with the first adventure of a three-volume series! ",
        "title": "MINECRAFT TP VOL 02 WITHER WITHOUT YOU",
        "price": "$10.99",
        "creators": "(W) Kristen Gudsnuk (A/CA) Kristen Gudsnuk",
        "release_date": "2020-09-02",
        "diamond_id": "JAN200310"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "When seemingly hostile Krill ships cross into Union space, the Orville intercepts. Captain Mercer learns they are en route to a planet that left the Union decades ago under mysterious circumstances. Scans have discovered a moon-sized construct above the planet, and the Krill intend a preemptive strike against the presumed weapon. But is it?  o Written by The Orville executive producer David A. Goodman!",
        "title": "ORVILLE #1 LAUNCH DAY (PT 1 OF 2) (RES)",
        "price": "$3.99",
        "creators": "(W) David Goodman (A/CA) David Cabeza",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200266"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "The gladiator sold his soul for revenge. The knight's a bigot. The dwarf only cares about regaining his honor. Even the wizardess seems too bookish for anyone's good. But they've all been hired by a blind seer to retrieve some forgotten knowledge long hidden away in a jungle-strangled ruin.  Get in. Get out. Get paid. At least that's what they thought. Instead, they uncover hidden agendas and ancient power struggles centuries in the making.",
        "title": "RETURN OF THE WIZARD KING TP VOL 01 PROSE NOVEL (RES)",
        "price": "$12.99",
        "creators": "(W) Chad Corrie",
        "release_date": "2020-09-02",
        "diamond_id": "JUN200326"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "Super spy Nora Freud (no relation) has a plum assignment.She's stationed on a tropical island. Her mission? Keep an eye on things. Her problem?The island is on the lip of the Bermuda Triangle, where anything can happen.Her other problem? This particular island is a den of intrigue, populated by spies, tourists, and evil villains set on global domination.  Spy Island is a four-issue special limited series by the creative team that brought you Man-Eaters.  New comics series from New York Times best-selling author Chelsea Cain!",
        "title": "SPY ISLAND #1 (OF 4) CVR A MITERNIQUE (RES)",
        "price": "$3.99",
        "creators": "(W) Chelsea Cain (A) Elise McCall (CA) Lia Miternique",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200261"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "Super spy Nora Freud (no relation) has a plum assignment.She's stationed on a tropical island. Her mission? Keep an eye on things. Her problem?The island is on the lip of the Bermuda Triangle, where anything can happen.Her other problem? This particular island is a den of intrigue, populated by spies, tourists, and evil villains set on global domination.  Spy Island is a four-issue special limited series by the creative team that brought you Man-Eaters.  New comics series from New York Times best-selling author Chelsea Cain!",
        "title": "SPY ISLAND #1 (OF 4) CVR B MITERNIQUE (RES)",
        "price": "$3.99",
        "creators": "(W) Chelsea Cain (A) Elise McCall (CA) Lia Miternique",
        "release_date": "2020-09-02",
        "diamond_id": "JUL200262"
      },
      {
        "publisher": "DARK HORSE COMICS",
        "description": "Years ago, the Killjoys fought against the tyrannical megacorporation Better Living Industries, costing them their lives, save for one-the mysterious Girl. Today, the followers of the original Killjoys languish in the Desert while BLI systematically strips citizens of their individuality. As the fight for freedom fades, it's left to the Girl to take up the mantle and bring down the fearsome BLI!  A direct tie-in to the My Chemical Romance albumDanger Days!  This new library edition collects the 2014 series The True Lives of the Fabulous Killjoys and the short story \"Dead Satellites,\" with the expanded sketchbook section from the limited edition, and a brand-new cover by Becky Cloonan.",
        "title": "TRUE LIVES FABULOUS KILLJOYS CALIFORNIA LIBRARY ED HC",
        "price": "$39.99",
        "creators": "(W) Gerard Way, Shaun Simon (A/CA) Becky Cloonan",
        "release_date": "2020-09-02",
        "diamond_id": "JUN200281"
      },
      {
        "publisher": "DC COMICS",
        "description": "Who comes out on top when Bumblebee, a journalist, and a super-villain get in a fight? Find out when Karen Beecher and Lois Lane face off in a battle of wits with... Harleen Quinzel?! Three students top the leaderboard at Metropolis High, and the upcoming midterms will determine who's the best in class. But each girl must first face challenges from their real lives!",
        "title": "DC SUPER HERO GIRLS MIDTERMS TP",
        "price": "$9.99",
        "creators": "",
        "release_date": "2020-09-02",
        "diamond_id": "APR200546"
      },
      {
        "publisher": "IDW PUBLISHING",
        "description": "The dream of a queer separatist town. The life of a gay Jewish Nazi-fighter. A gender reveal party that tears apart reality. These are the just some of the comics you'll find in this massive queer comics anthology from The Nib. Be Gay, Do Comics is filled with dozens of comics about LGBTQIA experiences, ranging from personal stories to queer history to cutting satire about pronoun panic and brands desperate to co-opt pride. Brimming with resilience, inspiration, and humor, an incredible lineup of top indie cartoonists takes you from the American Revolution through Stonewall to today's fights for equality and representation. Featuring more than 30 cartoonists including Hazel Newlevant, Joey Alison Sayers, Maia Kobabe, Matt Lubchansky, Breena Nu&#241;ez, Sasha Velour, Shing Yin Khor, Levi Hastings, Mady G, Bianca Xunise, Kazimir Lee, and many, many more!",
        "title": "BE GAY DO COMICS TP",
        "price": "$24.99",
        "creators": "(A) Hazel Reed Newlevant, Joey Alison Sayers, Maia Kobabe, Matt Lubchansky, Breena Nunez, Sasha Velour, Shing Yin Khor, Levi Hastings, Mady G, Bianca Xunise, Kazimir Lee (CA) VARIOUS",
        "release_date": "2020-09-02",
        "diamond_id": "APR200815"
      },
      {
        "publisher": "IDW PUBLISHING",
        "description": "Join Usagi on an exciting adventure as he meets his most unusual traveling companion yet... Chibi Usagi! The two worlds of Usagi Yojimbo meld for a hilarious story that's perfect for kids and long-time fans of Usagi alike! Rating: Teen",
        "title": "FCBD 2020 USAGI YOJIMBO",
        "price": "$PI",
        "creators": "(W) Stan Sakai (CA) Julie Fujii (A/CA) Stan Sakai",
        "release_date": "2020-09-02",
        "diamond_id": "JAN200029"
      },
      {
        "publisher": "IDW PUBLISHING",
        "description": "Follow one man's journey from the moment Godzilla's reign of destruction begins and continues over his lifetime, one battle after another. The year is 1954 and Lieutenant Ota Murakami is on hand when Godzilla makes first landfall in Japan. Along with his pal, Kentaro, Ota makes a desperate gamble to save lives... and in the process begins an obsession with the King of the Monsters that lasts 50 years ranging from Ghana, Bombay, and maybe the end of the world! Also included is an expanded art gallery and issue annotations by James Stokoe.",
        "title": "GODZILLA HALF CENTURY WAR HC",
        "price": "$29.99",
        "creators": "(W) James Stokoe (A/CA) James Stokoe",
        "release_date": "2020-09-02",
        "diamond_id": "MAR200802"
      },
      {
        "publisher": "IDW PUBLISHING",
        "description": "It's Spike and Grimlock's time to shine as they take on the Decepticons! Meanwhile, Pinkie Pie is determined to share as much knowledge about Equestrian and Autobot cuisine as possible with her new friends... which is why she invites Gauge to her kitchen for a live baking show! But things get a bit too spicy when Shockwave shows up. ",
        "title": "MY LITTLE PONY TRANSFORMERS #2 (OF 4) CVR A FLEECS",
        "price": "$3.99",
        "creators": "(W) Sam Maggs, Ian Flynn (A) Sara Pitre-Durocher, Casey Coller (CA) Tony Fleecs",
        "release_date": "2020-09-02",
        "diamond_id": "MAR200691"
      },
      {
        "publisher": "IDW PUBLISHING",
        "description": "Legendary writer J.M. DeMatteis returns to Star Trek for the first time in nearly 40 years! And it'll be well worth the wait, as he tackles two of the franchise's most popular concepts: Khan Noonien Singh and the Mirror Universe!",
        "title": "STAR TREK HELLS MIRROR CVR A SMITH",
        "price": "$4.99",
        "creators": "(W) J.M. Dematteis (A/CA) Matthew Dow Smith",
        "release_date": "2020-09-02",
        "diamond_id": "JAN200747"
      },
      {
        "publisher": "MARVEL COMICS",
        "description": " Showdown on Wall Street!",
        "title": "CAPTAIN AMERICA SAM WILSON #6",
        "price": "$3.99",
        "creators": "(W) Nick Spencer (A) Joe Bennett (CA) Oscar Jimenez",
        "release_date": "2016-02-03",
        "diamond_id": "DEC150773"
      },
      {
        "publisher": "DC COMICS",
        "description": "Let the doctor make you strong, ",
        "title": "BATMAN BEYOND #9",
        "price": "$2.99",
        "creators": "(W) Dan Jurgens (A) Bernard Chang (CA) Philip Tan",
        "release_date": "2016-02-03",
        "diamond_id": "DEC150278"
      },
      {
        "publisher": "MARVEL COMICS",
        "description": "The path of the All-Mother and Asgard is torn apart by civil war...",
        "title": "MIGHTY THOR #4",
        "price": "$3.99",
        "creators": "(W) Jason Aaron (A/CA) Russell Dauterman",
        "release_date": "2016-02-17",
        "diamond_id": "DEC150774"
      }
    ],
    "idealComicsData": [
      {
        "issue": "Captain America (2011 series) #1",
        "title": "Captain America 1",
        "publisher": "Marvel",
        "saleDate": "2011-07-13",
        "barCode": "759606076130 00111",
        "author": "Ed Brubaker",
        "pencils": "Steve McNiven",
        "inks": "Mark Morales",
        "colors": "Justin Ponsor",
        "cover": "https://files1.comics.org//img/gcd/covers_by_id/828/w200/828765.jpg?3502316149653890310",
        "variants": [
          {
            "variantName": "Blank Variant",
            "cover": "https://files1.comics.org//img/gcd/covers_by_id/826/w100/826968.jpg?-3763681325932997343"
          },
          {
            "variantName": "Movie Variant",
            "cover": "https://files1.comics.org//img/gcd/covers_by_id/829/w100/829042.jpg?4437358490004474580"
          },
          {
            "variantName": "John Romita Variant",
            "cover": "https://files1.comics.org//img/gcd/covers_by_id/872/w100/872541.jpg?-7327881023257121600"
          },
          {
            "variantName": "Niel Adams Variant",
            "cover": "https://files1.comics.org//img/gcd/covers_by_id/872/w100/872540.jpg?4338877358997547967"
          }
        ]
      }
    ]
  }
}
